## Staging Plan for s3_scan_object
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 4 to add, 0 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_permission.s3_scan_object_org_account_execute will be created
  + resource "aws_lambda_permission" "s3_scan_object_org_account_execute" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "s3-scan-object"
      + id                  = (known after apply)
      + principal           = "*"
      + principal_org_id    = (sensitive)
      + statement_id        = "AllowExecutionFromOrgAccounts"
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.scan_complete will be created
  + resource "aws_lambda_permission" "scan_complete" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "s3-scan-object"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = "arn:aws:sns:ca-central-1:127893201980:s3-scan-object-complete"
      + statement_id        = "S3ScanObjectSNSInvoke"
      + statement_id_prefix = (known after apply)
    }

  # aws_sns_topic_subscription.scan_complete will be created
  + resource "aws_sns_topic_subscription" "scan_complete" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ca-central-1:127893201980:s3-scan-object-complete"
    }

  # module.s3_scan_object.aws_lambda_function.this is tainted, so must be replaced
-/+ resource "aws_lambda_function" "this" {
      ~ architectures                  = [] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:127893201980:function:s3-scan-object" -> (known after apply)
      ~ id                             = "s3-scan-object" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:127893201980:function:s3-scan-object/invocations" -> (known after apply)
      ~ last_modified                  = "2022-07-12T19:18:25.879+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:127893201980:function:s3-scan-object:$LATEST" -> (known after apply)
      ~ reserved_concurrent_executions = -1 -> 3
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "9e8ac7ebf00f74a368b460a2b532364557f1e0e0f87c664b9393272191b2e947" -> (known after apply)
      ~ source_code_size               = 0 -> (known after apply)
        tags                           = {
            "CostCentre" = "scan-files-staging"
            "Terraform"  = "true"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (8 unchanged attributes hidden)


      ~ ephemeral_storage {
          ~ size = 512 -> (known after apply)
        }


      + vpc_config {
          + vpc_id = (known after apply)
        }
        # (2 unchanged blocks hidden)
    }

Plan: 4 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
